using System.Collections.Generic;

namespace DFA2.Model
{
    static class Abc  // описание автомата
    {
        // алфавит
        public static List<string> Alphabet = new List<string> { "int", "long", "float", "char", "bool", "double", "short", "l", "d", " ", "[", "]", "," };

        // функция переходов 
        public static int[][] Transitions = new int[][]{
                new int[] {1,11,3,3,3,13,15,-1,-1,0 },             
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,2},          
                new int[] {5,4,5,5,5,5,4,6,-1,2},                  
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,4},          
                new int[] {5,5,5,5,5,5,5,6,0,4},                   
                new int[] {6,6,6,6,6,6,6,6,6},                      
                new int[] {6,6,6,6,6,6,6,6,6,7,8,-1,4,-2},          
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,7,8,-1,4,-2},  
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,9,8,-1,7},       
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,9,10,-1,7},      
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,10,-1,7},      
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,12},           
                new int[] {3,5,5,5,5,3,5,6,-1,12},                   
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,14},           
                new int[] {5,4,5,5,5,5,5,6,-1,14},                   
                new int[] {-1,-1,-1,-1,-1,-1,-1,-1,-1,16},           
                new int[] {4,-1,-1,-1,-1,-1,-1,-1,-1,16},            
         };
    }
}
